{
  "measurementSystem": "imperial",
  "good-morning": "Good morning",
  "good-afternoon": "Good afternoon",
  "good-evening": "Good evening",
  "welcome-message": "{{greeting}}, {{name}}!",
  "start-workout": "Start Workout",
  "routines": "Routines",
  "progress": "Progress",
  "no-workouts": "No Workouts",
  "tip-information": "Your {{experience_level}} tip for today\n",
  "expert": "expert",
  "intermediate": "intermediate",
  "beginner": "beginner",
  "beginner-tip1": "Start Slow and Steady: Don't rush into intense workouts. Begin with light exercises to condition your body and avoid injury.",
  "beginner-tip2": "Focus on Form: Proper form is crucial to prevent injury and maximize results. Take time to learn the correct techniques for each exercise.",
  "beginner-tip3": "Listen to Your Body: Pay attention to how your body feels during workouts. If something doesn't feel right, stop and reassess rather than pushing through.",
  "beginner-tip4": "Stay Hydrated: Drink water before, during, and after your workouts to stay hydrated and maintain performance.",
  "beginner-tip5": "Consistency Over Intensity: Consistent workouts are more beneficial than occasional intense sessions. Aim for regular exercise routines.",
  "beginner-tip6": "Rest and Recovery: Allow your body time to rest and recover between workouts. Overtraining can lead to burnout and injuries.",
  "beginner-tip7": "Recovery Nutrition: After workouts, refuel your body with a balanced meal or snack containing carbohydrates and protein to aid in muscle recovery and replenish energy stores.",
  "beginner-tip8": "Practice Mind-Muscle Connection: Focus on engaging the target muscles during exercises by consciously contracting and squeezing them, which can enhance muscle activation and growth.",
  "beginner-tip9": "Learn Proper Equipment Usage: Take the time to familiarize yourself with gym equipment to ensure safe and effective usage, and don't hesitate to ask gym staff for guidance if needed.",
  "beginner-tip10": "Set Realistic Expectations: Understand that progress takes time, and avoid comparing yourself to others. Focus on your own journey and celebrate small victories along the way.",
  "beginner-tip11": "Hygiene Matters: Always wipe down equipment before and after use, and practice good hygiene habits like washing your hands regularly to prevent the spread of germs and bacteria.",
  "intermediate-tip1": "Progressive Overload: Continuously challenge yourself by increasing weights, reps, or intensity to stimulate muscle growth and strength gains.",
  "intermediate-tip2": "Vary Your Workouts: Incorporate a variety of exercises to target different muscle groups and prevent plateaus.",
  "intermediate-tip3": "Warm Up Properly: Spend at least 5-10 minutes warming up before each workout to increase blood flow and flexibility, reducing the risk of injury.",
  "intermediate-tip4": "Nutrition Matters: Pay attention to your diet, ensuring you're getting enough protein, carbohydrates, and healthy fats to support your fitness goals.",
  "intermediate-tip5": "Track Your Progress: Keep a workout log or use fitness apps to track your progress and adjust your routines accordingly.",
  "intermediate-tip6": "Don't Skip Recovery Days: Scheduled rest days are essential for muscle repair and growth. Use these days for light activity, stretching, or active recovery.",
  "intermediate-tip7": "Mindful Recovery Techniques: Incorporate mindfulness practices such as deep breathing exercises, meditation, or yoga to promote relaxation and stress reduction, which can aid in recovery and improve overall well-being.",
  "intermediate-tip8": "Utilize Resistance Bands: Integrate resistance bands into your workouts to add variety and challenge different muscle groups while also improving stability and joint mobility.",
  "intermediate-tip9": "Experiment with Tempo Training: Manipulate the tempo (speed) of your repetitions during exercises to create different training stimuli and elicit specific adaptations such as muscle hypertrophy or strength gains.",
  "intermediate-tip10": "Practice Pre-Workout Activation: Perform dynamic warm-up exercises or activation drills targeting specific muscle groups before your workouts to enhance muscle recruitment and improve performance.",
  "intermediate-tip11": "Attend Group Fitness Classes: Participate in group fitness classes such as spinning, Pilates, or dance workouts to add diversity to your routine, stay motivated, and connect with like-minded individuals.",
  "expert-tip1": "Periodize Your Training: Implement periodization techniques to vary intensity and volume over time for optimal performance and adaptation.",
  "expert-tip2": "Incorporate Mobility Work: Focus on mobility exercises and flexibility training to improve joint health and range of motion.",
  "expert-tip3": "Experiment with Advanced Techniques: Explore advanced training methods like supersets, drop sets, and pyramids to challenge your body in new ways.",
  "expert-tip4": "Listen to Your Body Again: As an expert, you may be tempted to push through discomfort, but it's crucial to recognize when to back off to prevent overuse injuries.",
  "expert-tip5": "Mental Conditioning: Develop mental resilience and focus through techniques like visualization, meditation, and mindfulness practices.",
  "expert-tip6": "Continual Learning: Stay updated on the latest research and trends in fitness and nutrition to refine your training methods and stay ahead in your field.",
  "expert-tip7": "Optimize Nutrient Timing: Strategically time your meals and snacks around your workouts to optimize performance, recovery, and nutrient absorption, considering factors like macronutrient composition and meal timing.",
  "expert-tip8": "Utilize Recovery Tools: Invest in recovery tools such as compression garments, percussion massagers, or cold therapy devices to accelerate recovery, reduce muscle soreness, and enhance overall recovery efficiency.",
  "expert-tip9": "Implement Deload Weeks: Periodically incorporate deload weeks into your training program, where you reduce training volume and intensity to allow for systemic recovery and prevent overtraining.",
  "expert-tip10": "Focus on Mindful Movement: Practice mindful movement techniques such as tai chi, qigong, or Feldenkrais method to improve body awareness, movement quality, and neuromuscular coordination.",
  "expert-tip11": "Embrace Active Lifestyle Habits: Incorporate physical activity into your daily routine beyond structured workouts, such as taking the stairs instead of the elevator or walking or biking for transportation whenever possible, to promote overall health and longevity.",
  "search-placeholder": "Search...",
  "workout-clipboard-copied-success": "Workout copied to clipboard",
  "exit-confirmation": "Are you sure you want to exit?",
  "exit-text": "There may be unsaved changes. Press back again to confirm exit.",
  "goals": "Goals",
  "loading": "Loading",
  "home": "Home",
  "about": "About",
  "workout": "Workout",
  "viewWorkout": "View Workout",
  "login": "Login",
  "skill-level": "Skill Level",
  "unit-selection": "Unit Selection",
  "register": "Register",
  "settings": "Settings",
  "troubleshooting": "troubleshooting",
  "create-movement": "Create Movement",
  "preferences-settings": "Preferences Settings",
  "inspect-routine": "Inspect Routine",
  "create-routine": "Create Routine",
  "account-settings": "Account Settings",
  "terms-of-service": "Terms of Service",
  "appearance": "Appearance",
  "notification-settings": "Notification Settings",
  "tip-settings": "Tip Settings",
  "account": "Account",
  "send-feedback": "Send Feedback",
  "midnight": "Midnight",
  "deep-sea": "Deep Sea",
  "sunset": "Sunset",
  "light": "Light",
  "feedback-placeholder": "What's on your mind?",
  "feedback-sent": "Feedback sent!",
  "logout": "Logout",
  "logout-confirmation": "Are you sure you want to log out?",
  "yes-from-all-devices": "Yes, log me out from all devices",
  "just-this-device": "Logout just from  this device",
  "cancel": "Cancel",
  "something-went-wrong": "Something went wrong!",
  "invalid-email": "Invalid email or email already in use",
  "email-success": "Email successfully updated",
  "password-success": "Password successfully updated",
  "invalid-password": "Invalid password",
  "password-match": "Passwords do not match",
  "email": "Email",
  "password": "Password",
  "new-password": "New Password",
  "confirm-password": "Confirm Password",
  "change-email": "Change Email",
  "change-password": "Change Password",
  "save": "Save",
  "change-primary-color": "Change Primary Color",
  "change-secondary-color": "Change Secondary Color",
  "change-tertiary-color": "Change Tertiary Color",
  "change-quaternary-color": "Change Quaternary Color",
  "reset-to-default": "Reset to Default",
  "theme-reset": "Theme reset to default",
  "select": "Select",
  "triceps": "Triceps",
  "shoulders": "Shoulders",
  "biceps": "Biceps",
  "chest": "Chest",
  "back": "Back",
  "legs": "Legs",
  "core": "Core",
  "other": "Other",
  "movement-name-empty": "Movement name cannot be empty",
  "movement-success": "Movement successfully created",
  "movement-name-placeholder": "Enter movement name",
  "muscle-category": "Muscle Category:",
  "movement-name": "Movement Name:",
  "routine-name-empty": "Routine name cannot be empty",
  "routine-success": "Routine successfully created",
  "routine-movements-empty": "Routine must have at least one movement",
  "routine-name-placeholder": "Routine name",
  "routine-notes-placeholder": "Routine notes",
  "select-movement": "Select Movements",
  "fill-all-fields": "Please fill out all fields",
  "failed-to-create-goal": "Failed to create a goal",
  "goal-success": "Goal successfully created",
  "select-goal": "Please select a goal to add the addition into",
  "enter-amount-progress": "Enter an amount for your progress",
  "failed-to-add-progress": "Failed to add progress",
  "not-enough-data": "Not enough data to plot progress",
  "goal-header": "{{goal_name}} of {{goal_amount}} {{goal_unit}} by {{goal_date}}",
  "you-have-selected-dates": "You have selected the dates between {{start_date}} and {{end_date}}",
  "you-have-selected-value": "You have selected value: {{value}} {{unit}} on {{date}}",
  "you-have-achieved-between": "You have achieved {{number}} of {{unit}} between these dates",
  "no-data-selected": "No data selected",
  "note-information": "Note: {{note}}",
  "daily-recommendation-amount": "{{number}} {{unit}} is your daily recommended amount",
  "goal-left": "You have {{number}} {{unit}} left to achieve your goal",
  "no-goal-selected": "You have no goal selected",
  "choose-goal": "Choose a goal to view progress for",
  "new-goal": "Create a new goal",
  "goal-name": "Goal's name:",
  "goal-name-placeholder": "Goal name",
  "goal-date": "Goal's date:",
  "goal-unit": "Goal's unit:",
  "goal-target-amount": "Goal's target amount:",
  "goal-target-amount-placeholder": "Target amount",
  "metric-unit-examples": "Units (e.g., steps, cm, kg)",
  "imperial-unit-examples": "Units (e.g., steps, inches, lbs)",
  "select-date": "Select date: {{date}}",
  "add-progress": "Add progress",
  "add-progress-to-goal": "Add progress to goal",
  "add-note-placeholder": "Add a note to your progress for this day",
  "note": "Note:",
  "amount": "Amount:",
  "amount-placeholder": "Your progress today (e.g, -5,10,100)",
  "goal-choice-placeholder": "Choose a goal or goals to add progress to",
  "add": "Add",
  "movement": "Movement: {{movement_name}}",
  "routine": "Routine: {{routine_name}}",
  "wrong-email-or-password": "Wrong email or password",
  "notification-status": "Notifications are currently {{status}}",
  "enable-notifications": "Enable Notifications",
  "disable-notifications": "Disable Notifications",
  "selected-unit": "Selected unit: {{unit}}",
  "nothing-selected": "Nothing selected",
  "selected-experience": "Selected experience level: {{level}}",
  "metric": "Metric",
  "imperial": "Imperial",
  "confirm": "Confirm",
  "username-already-exists": "Username already exists",
  "password-length": "Password must be at least 5 characters long",
  "username": "Username",
  "start": "Start",
  "no-training-plans": "No training plans available",
  "create-routine-hint": "Press create routine to create your first routine!",
  "select-skill-level-hint": "Select your skill level to get started!",
  "beginner-description": "You are new to the gym with less than a year of experience.",
  "intermediate-description": "You have been working out for 1-3 years and are looking to take your fitness to the next level.",
  "expert-description": "You have been lifing consistently for a many years, you know your  stuff and probably compete.",
  "next": "Next",
  "tips-status": "Tips are currently {{status}}",
  "enabled": "Enabled",
  "disabled": "Disabled",
  "enable-tips": "Enable Tips",
  "disable-tips": "Disable Tips",
  "terms-of-service-title": "GenieGains's Terms of Service",
  "preferences": "Preferences",
  "terms-of-service-text-1": " 1. Terms\nBy using the GymJjunkie app, you are agreeing to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this application. The materials contained in this application are protected by applicable copyright and trademark law.\n\n",
  "terms-of-service-text-2": "2. Use License\nPermission is granted to temporarily download one copy of the materials (information or software) on GenieGains's application for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not: modify or copy the materials; use the materials for any commercial purpose, or for any public display (commercial or non-commercial); attempt to decompile or reverse engineer any software contained on GenieGains's application; remove any copyright or other proprietary notations from the materials; or transfer the materials to another person or 'mirror' the materials on any other server. This license shall automatically terminate if you violate any of these restrictions and may be terminated by GenieGains at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n\n",
  "terms-of-service-text-3": "3. Disclaimer\nThe materials on GenieGains's application are provided on an 'as is' basis. GenieGains makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, GenieGains does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its application or otherwise relating to such materials or on any sites linked to this application.\n\n",
  "terms-of-service-text-4": "4. Limitations\nIn no event shall GenieGains or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on GenieGains's application, even if GenieGains or a GenieGains authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n",
  "terms-of-service-text-5": "5. Accuracy of materials\nThe materials appearing on GenieGains's application could include technical, typographical, or photographic errors. GenieGains does not warrant that any of the materials on its application are accurate, complete or current. GenieGains may make changes to the materials contained on its application at any time without notice. However GenieGains does not make any commitment to update the materials.\n\n",
  "terms-of-service-text-6": " 6. Links\nGenieGains has not reviewed all of the sites linked to its application and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by GenieGains of the site. Use of any such linked application is at the user's own risk.\n\n",
  "terms-of-service-text-7": "7. You shall give us your firstborn child\nYou shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child. You shall give us your firstborn child.\n\n",
  "how-to-create-workout": "1. How to create workout?",
  "workout-creation-hint": "To create a workout, you need to go to the homescreen and click on the 'Start Workout' button. Then you can select either to create a new workout or select a workout from the list of workouts.",
  "how-to-delete-workout": "2. How to delete workout?",
  "delete-workout-hint": "To delete a workout, you need to go to the homescreen and click on the workout you want to delete. Then you can delete the workout by clicking the three dots on the top right corner and then click on the 'Delete' button.",
  "how-to-create-workout-template": "3. How to create new workout templates?",
  "how-to-create-routine-hint": "To create a new workout template, you need to go to the homescreen and tap on the 'Routines' from the bottom navigation. Then you can create a new workout template by clicking on the 'Create Routine' button. From there, you can add new movements to the workout template, and then save the workout template by clicking on the 'Save' button.",
  "how-to-add-movement": "4. How to add new movements?",
  "how-to-add-movement-hint": "To add new movements, you need to go to the homescreen and tap on the 'Routines' from the bottom navigation. Then you can create a new workout template by clicking on the 'Create Movement' button. From there, you can specify the name and the muscle group of the movement, and then save the movement by clicking on the 'Save' button.",
  "measurement-unit-hint": "Select the measurement unit you prefer to use in the app.",
  "metric-example": "Eg. Kilograms, Meters, etc.",
  "imperial-example": "Eg. Pounds, Feet, etc.",
  "workout-example-name": "Workout {{date}}",
  "workout-name": "Workout Name",
  "notes": "notes",
  "select-movements": "Select Movements",
  "no-exercises": "No exercises added",
  "finish-workout": "Finish Workout",
  "add-set": "Add Set",
  "weight": "Weight",
  "reps": "Reps",
  "language": "{{language}}",
  "language-settings": "Language Settings",
  "select-language": "Select Language",
  "about-description": "This is a fitness app that helps you track your workouts and progress.",
  "success": "Success!",
  "error": "Error!",
  "name": "Name",
  "retype-password": "Retype Password",
  "beginner-hint": "You are new to the gym with less than a year of experience.",
  "intermediate-hint": "You have been lifing consistently for a few years.",
  "expert-hint": "You are a professional and know what you're doing and probably compete.",
  "go-back": "Back"
}
