{
  "measurementSystem": "imperial",
  "good-morning": "Good morning",
  "good-afternoon": "Good afternoon",
  "good-evening": "Good evening",
  "welcome-message": "{{greeting}}, {{name}}!",
  "start-workout": "Start Workout",
  "routines": "Routines",
  "progress": "Progress",
  "no-workouts": "No Workouts",
  "tip-information": "Your {{experience_level}} tip for today\n",
  "expert": "expert",
  "intermediate": "intermediate",
  "beginner": "beginner",
  "beginner-tip1": "Start Slow and Steady: Don't rush into intense workouts. Begin with light exercises to condition your body and avoid injury.",
  "beginner-tip2": "Focus on Form: Proper form is crucial to prevent injury and maximize results. Take time to learn the correct techniques for each exercise.",
  "beginner-tip3": "Listen to Your Body: Pay attention to how your body feels during workouts. If something doesn't feel right, stop and reassess rather than pushing through.",
  "beginner-tip4": "Stay Hydrated: Drink water before, during, and after your workouts to stay hydrated and maintain performance.",
  "beginner-tip5": "Consistency Over Intensity: Consistent workouts are more beneficial than occasional intense sessions. Aim for regular exercise routines.",
  "beginner-tip6": "Rest and Recovery: Allow your body time to rest and recover between workouts. Overtraining can lead to burnout and injuries.",
  "beginner-tip7": "Recovery Nutrition: After workouts, refuel your body with a balanced meal or snack containing carbohydrates and protein to aid in muscle recovery and replenish energy stores.",
  "beginner-tip8": "Practice Mind-Muscle Connection: Focus on engaging the target muscles during exercises by consciously contracting and squeezing them, which can enhance muscle activation and growth.",
  "beginner-tip9": "Learn Proper Equipment Usage: Take the time to familiarize yourself with gym equipment to ensure safe and effective usage, and don't hesitate to ask gym staff for guidance if needed.",
  "beginner-tip10": "Set Realistic Expectations: Understand that progress takes time, and avoid comparing yourself to others. Focus on your own journey and celebrate small victories along the way.",
  "beginner-tip11": "Hygiene Matters: Always wipe down equipment before and after use, and practice good hygiene habits like washing your hands regularly to prevent the spread of germs and bacteria.",
  "intermediate-tip1": "Progressive Overload: Continuously challenge yourself by increasing weights, reps, or intensity to stimulate muscle growth and strength gains.",
  "intermediate-tip2": "Vary Your Workouts: Incorporate a variety of exercises to target different muscle groups and prevent plateaus.",
  "intermediate-tip3": "Warm Up Properly: Spend at least 5-10 minutes warming up before each workout to increase blood flow and flexibility, reducing the risk of injury.",
  "intermediate-tip4": "Nutrition Matters: Pay attention to your diet, ensuring you're getting enough protein, carbohydrates, and healthy fats to support your fitness goals.",
  "intermediate-tip5": "Track Your Progress: Keep a workout log or use fitness apps to track your progress and adjust your routines accordingly.",
  "intermediate-tip6": "Don't Skip Recovery Days: Scheduled rest days are essential for muscle repair and growth. Use these days for light activity, stretching, or active recovery.",
  "intermediate-tip7": "Mindful Recovery Techniques: Incorporate mindfulness practices such as deep breathing exercises, meditation, or yoga to promote relaxation and stress reduction, which can aid in recovery and improve overall well-being.",
  "intermediate-tip8": "Utilize Resistance Bands: Integrate resistance bands into your workouts to add variety and challenge different muscle groups while also improving stability and joint mobility.",
  "intermediate-tip9": "Experiment with Tempo Training: Manipulate the tempo (speed) of your repetitions during exercises to create different training stimuli and elicit specific adaptations such as muscle hypertrophy or strength gains.",
  "intermediate-tip10": "Practice Pre-Workout Activation: Perform dynamic warm-up exercises or activation drills targeting specific muscle groups before your workouts to enhance muscle recruitment and improve performance.",
  "intermediate-tip11": "Attend Group Fitness Classes: Participate in group fitness classes such as spinning, Pilates, or dance workouts to add diversity to your routine, stay motivated, and connect with like-minded individuals.",
  "expert-tip1": "Periodize Your Training: Implement periodization techniques to vary intensity and volume over time for optimal performance and adaptation.",
  "expert-tip2": "Incorporate Mobility Work: Focus on mobility exercises and flexibility training to improve joint health and range of motion.",
  "expert-tip3": "Experiment with Advanced Techniques: Explore advanced training methods like supersets, drop sets, and pyramids to challenge your body in new ways.",
  "expert-tip4": "Listen to Your Body Again: As an expert, you may be tempted to push through discomfort, but it's crucial to recognize when to back off to prevent overuse injuries.",
  "expert-tip5": "Mental Conditioning: Develop mental resilience and focus through techniques like visualization, meditation, and mindfulness practices.",
  "expert-tip6": "Continual Learning: Stay updated on the latest research and trends in fitness and nutrition to refine your training methods and stay ahead in your field.",
  "expert-tip7": "Optimize Nutrient Timing: Strategically time your meals and snacks around your workouts to optimize performance, recovery, and nutrient absorption, considering factors like macronutrient composition and meal timing.",
  "expert-tip8": "Utilize Recovery Tools: Invest in recovery tools such as compression garments, percussion massagers, or cold therapy devices to accelerate recovery, reduce muscle soreness, and enhance overall recovery efficiency.",
  "expert-tip9": "Implement Deload Weeks: Periodically incorporate deload weeks into your training program, where you reduce training volume and intensity to allow for systemic recovery and prevent overtraining.",
  "expert-tip10": "Focus on Mindful Movement: Practice mindful movement techniques such as tai chi, qigong, or Feldenkrais method to improve body awareness, movement quality, and neuromuscular coordination.",
  "expert-tip11": "Embrace Active Lifestyle Habits: Incorporate physical activity into your daily routine beyond structured workouts, such as taking the stairs instead of the elevator or walking or biking for transportation whenever possible, to promote overall health and longevity.",
  "search-placeholder": "Search...",
  "workout-clipboard-copied-success": "Workout copied to clipboard"
}
