{
  "measurementSystem": "metric",
  "good-morning": "Hyvää huomenta",
  "good-afternoon": "Hyvää iltapäivää",
  "good-evening": "Hyvää iltaa",
  "welcome-message": "{{greeting}}, {{name}}!",
  "start-workout": "Aloita treeni",
  "routines": "Rutiinit",
  "progress": "Edistyminen",
  "no-workouts": "Ei treenejä",
  "tip-information": "Sinun {{experience_level}} vinkkisi tänään\n",
  "expert": "asiantuntija",
  "intermediate": "välitaso",
  "beginner": "aloittelija",
  "beginner-tip1": "Aloita hitaasti ja varovasti: Älä ryntää rankkoihin treeneihin. Aloita kevyillä harjoituksilla kehittääksesi kehoasi ja välttääksesi loukkaantumisia.",
  "beginner-tip2": "Keskity oikeaan tekniikkaan: Oikea tekniikka on tärkeää loukkaantumisten välttämiseksi ja tulosten maksimoimiseksi. Opettele oikeat tekniikat jokaiseen liikkeeseen.",
  "beginner-tip3": "Kuuntele kehoasi: Kiinnitä huomiota siihen, miltä kehosi tuntuu treenien aikana. Jos jokin ei tunnu oikealta, pysähdy ja arvioi tilanne uudelleen sen sijaan, että jatkaisit väkisin.",
  "beginner-tip4": "Pidä huolta nesteytyksestä: Juo vettä ennen treeniä, sen aikana ja jälkeen pysyäksesi nesteytettynä ja ylläpitääksesi suorituskykyäsi.",
  "beginner-tip5": "Säännöllisyys ennen intensiteettiä: Säännölliset treenit ovat hyödyllisempiä kuin satunnaiset intensiiviset harjoitukset. Pyri säännöllisiin harjoitusohjelmiin.",
  "beginner-tip6": "Lepo ja palautuminen: Anna kehollesi aikaa levätä ja palautua treenien välissä. Ylikunto voi johtaa uupumukseen ja loukkaantumisiin.",
  "beginner-tip7": "Palautusruokavalio: Treenien jälkeen tankkaa kehosi tasapainoisella aterialla tai välipalalla, joka sisältää hiilihydraatteja ja proteiinia auttaakseen lihasten palautumisessa ja energiavarastojen täyttämisessä.",
  "beginner-tip8": "Keskity mieli-lihaskontaktiin: Keskity kohdelihasten aktivoimiseen liikkeiden aikana tietoisesti supistamalla niitä, mikä voi tehostaa lihasten aktivointia ja kasvua.",
  "beginner-tip9": "Opi käyttämään laitteita oikein: Tutustu kuntosalilaitteisiin varmistaaksesi niiden turvallisen ja tehokkaan käytön, ja älä epäröi pyytää apua kuntosalin henkilökunnalta tarvittaessa.",
  "beginner-tip10": "Aseta realistiset odotukset: Ymmärrä, että kehitys vie aikaa, ja vältä vertaamasta itseäsi muihin. Keskitä huomiosi omaan kehitykseesi ja juhlista pieniä voittoja matkan varrella.",
  "beginner-tip11": "Hygienia on tärkeää: Pyyhi aina laitteet ennen ja jälkeen käytön, ja harjoita hyviä hygieniakäytäntöjä, kuten käsihygieniaa, bakteerien ja taudinaiheuttajien leviämisen estämiseksi.",
  "intermediate-tip1": "Progressiivinen ylikuormitus: Haasta itsesi jatkuvasti lisäämällä painoja, toistoja tai intensiteettiä lihaskasvun ja voimatasojen saavuttamiseksi.",
  "intermediate-tip2": "Vaihtele treenejäsi: Sisällytä erilaisia liikkeitä, jotka kohdistuvat eri lihasryhmiin ja estävät kehityksen pysähtymisen.",
  "intermediate-tip3": "Lämmittele kunnolla: Käytä vähintään 5-10 minuuttia lämmittelyyn ennen jokaista treeniä lisäämällä verenkiertoa ja joustavuutta, mikä vähentää loukkaantumisriskiä.",
  "intermediate-tip4": "Ravinto on tärkeää: Kiinnitä huomiota ruokavalioosi varmistaaksesi, että saat tarpeeksi proteiinia, hiilihydraatteja ja terveellisiä rasvoja tukemaan kuntoilutavoitteitasi.",
  "intermediate-tip5": "Seuraa edistymistäsi: Pidä treenipäiväkirjaa tai käytä kuntoiluappeja seurataksesi edistymistäsi ja säätääksesi rutiinejasi sen mukaisesti.",
  "intermediate-tip6": "Älä jätä palautuspäiviä väliin: Suunnitellut lepopäivät ovat olennaisia lihasten korjaamiseen ja kasvuun. Käytä näitä päiviä kevyisiin aktiviteetteihin, venyttelyyn tai aktiiviseen palautumiseen.",
  "intermediate-tip7": "Tietoiset palautumistekniikat: Sisällytä tietoisuustaitojen harjoituksia, kuten syvähengitysharjoituksia, meditaatiota tai joogaa, rentoutumisen ja stressinhallinnan edistämiseksi, mikä voi helpottaa palautumista ja parantaa yleistä hyvinvointia.",
  "intermediate-tip8": "Hyödynnä vastuskuminauhoja: Lisää vastuskuminauhat treeneihisi vaihtelun ja eri lihasryhmien haastamisen vuoksi samalla parantaen vakautta ja nivelten liikkuvuutta.",
  "intermediate-tip9": "Kokeile tempotreenausta: Säädä toistojen tempoa (nopeutta) harjoitusten aikana luodaksesi erilaisia ​​harjoitusärsykkeitä ja saadaksesi aikaan tiettyjä sopeutumisia, kuten lihaskasvua tai voimatasojen nousua.",
  "intermediate-tip10": "Harjoita ennen treeniä aktivointia: Tee dynaamisia lämmittelyliikkeitä tai aktivointiharjoituksia, jotka kohdistuvat tiettyihin lihasryhmiin ennen treenejäsi parantaaksesi lihasten aktivoitumista ja suorituskykyäsi.",
  "intermediate-tip11": "Osallistu ryhmäliikuntatunneille: Osallistu ryhmäliikuntatunneille, kuten spinningiin, pilatekseen tai tanssitunteihin, lisätäksesi monipuolisuutta harjoitteluusi, pysyäksesi motivoituneena ja luodaksesi yhteyksiä samanhenkisiin ihmisiin.",
  "expert-tip1": "Treenisi periodisointi: Käytä periodisointitekniikoita vaihdellen intensiteettiä ja volyymia ajan myötä optimaalisen suorituskyvyn ja sopeutumisen saavuttamiseksi.",
  "expert-tip2": "Sisällytä liikkuvuusharjoituksia: Keskity liikkuvuusharjoituksiin ja venyttelyyn parantaaksesi nivelten terveyttä ja liikkuvuutta.",
  "expert-tip3": "Kokeile edistyneitä tekniikoita: Tutki edistyneitä harjoitusmenetelmiä, kuten supersarjoja, pudotussarjoja ja pyramidiharjoittelua, haastaaksesi kehoasi uusilla tavoilla.",
  "expert-tip4": "Kuuntele kehoasi uudelleen: Vaikka oletkin asiantuntija, saatat haluta painaa läpi epämukavuuden, mutta on tärkeää tunnistaa, milloin perääntyä ylikuormitusten välttämiseksi.",
  "expert-tip5": "Mielenvahvuuden kehittäminen: Kehitä henkistä kestävyyttä ja keskittymistä visualisoinnin, meditaation ja tietoisuusharjoitusten avulla.",
  "expert-tip6": "Jatkuva oppiminen: Pysy ajan tasalla viimeisimmästä tutkimuksesta ja trendeistä kuntoilun ja ravitsemuksen alalla hienosäätääksesi treenimetodejasi ja pysyäksesi askeleen edellä alallasi.",
  "expert-tip7": "Optimoi ravinteiden ajoitus: Ajoita ateriasi ja välipalasi strategisesti treenien ympärille suorituskyvyn, palautumisen ja ravinteiden imeytymisen optimoimiseksi ottaen huomioon tekijät kuten makroravinteiden koostumus ja ajoitus.",
  "expert-tip8": "Hyödynnä palautumistyökaluja: Sijoita palautumistyökaluihin, kuten puristusvaatteisiin, iskutusmassoihin tai kylmähoitolaitteisiin nopeuttaaksesi palautumista, vähentääksesi lihaskipua ja tehostaaksesi kokonaisvaltaista palautumista.",
  "expert-tip9": "Toteuta kevennysviikot: Sisällytä ajoittain kevennysviikkoja treeniohjelmaasi, jolloin vähennät harjoitusmäärää ja -intensiteettiä, jotta mahdollistat kokonaisvaltaisen palautumisen ja estät ylikuormittumisen.",
  "expert-tip10": "Keskity tietoisen liikkeen harjoitteluun: Harjoita tietoisen liikkeen tekniikoita, kuten tai chi:ta, qigongia tai Feldenkrais-menetelmää, kehon tietoisuuden, liikelaadun ja neuromuskulaarisen koordinaation parantamiseksi.",
  "expert-tip11": "Omaksu aktiivisia elämäntapavalmiuksia: Sisällytä fyysistä aktiivisuutta päivittäiseen rutiiniisi rakenteellisten treenien ulkopuolella, kuten portaiden käyttämistä hissin sijaan tai kävelemällä tai pyöräilemällä kuljetusvälineenä aina kun mahdollista, edistääksesi kokonaisvaltaista terveyttä ja pitkäikäisyyttä.",
  "search-placeholder": "Hae...",
  "workout-clipboard-copied-success": "Treeni kopioitu leikepöydälle",
  "exit-confirmation": "Oletko varma, että haluat poistua?",
  "exit-text": "Saattaa olla tallentamattomia muutoksia. Paina takaisin uudelleen vahvistaaksesi poistumisen.",
  "goals": "Tavoitteet",
  "loading": "Lataus",
  "home": "Koti",
  "about": "Tietoja",
  "workout": "Treeni",
  "viewWorkout": "Näytä treeni",
  "login": "Kirjaudu sisään",
  "skill-level": "Taitotaso",
  "unit-selection": "Yksikkövalinta",
  "register": "Rekisteröidy",
  "settings": "Asetukset",
  "troubleshooting": "Vianmääritys",
  "create-movement": "Luo liike",
  "preferences-settings": "Asetusten asetukset",
  "inspect-routine": "Tarkastele rutiiniä",
  "create-routine": "Luo rutiini",
  "account-settings": "Tilin asetukset",
  "terms-of-service": "Käyttöehdot",
  "appearance": "Ulkoasu",
  "notification-settings": "Ilmoitusasetukset",
  "tip-settings": "Vinkkiasetukset",
  "account": "Tili",
  "send-feedback": "Lähetä palautetta",
  "midnight": "Keskiyö",
  "deep-sea": "Syvämeri",
  "sunset": "Auringonlasku",
  "light": "Valo",
  "feedback-placeholder": "Mitä mielessäsi?",
  "feedback-sent": "Palaute lähetetty!",
  "logout": "Kirjaudu ulos",
  "logout-confirmation": "Oletko varma, että haluat kirjautua ulos?",
  "yes-from-all-devices": "Kyllä, kirjaudu minut ulos kaikista laitteista",
  "just-this-device": "Kirjaudu ulos vain tästä laitteesta",
  "cancel": "Peruuta",
  "something-went-wrong": "Jotain meni pieleen!",
  "invalid-email": "Virheellinen sähköposti tai sähköposti on jo käytössä",
  "email-success": "Sähköposti päivitetty onnistuneesti",
  "password-success": "Salasana päivitetty onnistuneesti",
  "invalid-password": "Virheellinen salasana",
  "password-match": "Salasanat eivät täsmää",
  "email": "Sähköposti",
  "password": "Salasana",
  "new-password": "Uusi salasana",
  "confirm-password": "Vahvista salasana",
  "change-email": "Vaihda sähköposti",
  "change-password": "Vaihda salasana",
  "save": "Tallenna",
  "change-primary-color": "Vaihda ensisijainen väri",
  "change-secondary-color": "Vaihda toissijainen väri",
  "change-tertiary-color": "Vaihda kolmannen asteen väri",
  "change-quaternary-color": "Vaihda neljännen asteen väri",
  "reset-to-default": "Palauta oletusarvoihin",
  "theme-reset": "Teema palautettu oletusarvoihin",
  "select": "Valitse",
  "triceps": "Ojentajat",
  "shoulders": "Olkapäät",
  "biceps": "Hauikset",
  "chest": "Rinta",
  "back": "Selkä",
  "legs": "Jalat",
  "core": "Keski-alue",
  "other": "Muut",
  "movement-name-empty": "Liikkeen nimi ei voi olla tyhjä",
  "movement-success": "Liike luotu onnistuneesti",
  "movement-name-placeholder": "Kirjoita liikkeen nimi",
  "muscle-category": "Lihasryhmä:",
  "movement-name": "Liikkeen nimi:",
  "routine-name-empty": "Rutiinin nimi ei voi olla tyhjä",
  "routine-success": "Rutiini luotu onnistuneesti",
  "routine-movements-empty": "Rutiinissa on oltava vähintään yksi liike",
  "routine-name-placeholder": "Rutiinin nimi",
  "routine-notes-placeholder": "Rutiinin muistiinpanot",
  "select-movement": "Valitse liikkeet",
  "fill-all-fields": "Täytä kaikki kentät",
  "failed-to-create-goal": "Tavoitteen luominen epäonnistui",
  "goal-success": "Tavoite luotu onnistuneesti",
  "select-goal": "Valitse tavoite lisätäksesi lisäyksen",
  "enter-amount-progress": "Kirjoita määrä edistymiselle",
  "failed-to-add-progress": "Edistyksen lisääminen epäonnistui",
  "not-enough-data": "Ei tarpeeksi tietoja edistyksen esittämiseksi",
  "goal-header": "{{goal_name}}:n {{goal_amount}} {{goal_unit}} saavuttamiseksi {{goal_date}} mennessä",
  "you-have-selected-dates": "Olet valinnut päivämäärät {{start_date}} ja {{end_date}} välillä",
  "you-have-selected-value": "Olet valinnut arvon: {{value}} {{unit}} päivänä {{date}}",
  "you-have-achieved-between": "Olet saavuttanut {{number}} {{unit}} näiden päivämäärien välillä",
  "no-data-selected": "Ei valittuja tietoja",
  "note-information": "Huom: {{note}}",
  "daily-recommendation-amount": "{{number}} {{unit}} on päivittäinen suositeltu määräsi",
  "goal-left": "Sinulla on jäljellä {{number}} {{unit}} saavuttaaksesi tavoitteesi",
  "no-goal-selected": "Sinulla ei ole valittuna tavoitetta",
  "choose-goal": "Valitse tavoite nähdäksesi edistyksen",
  "new-goal": "Luo uusi tavoite",
  "goal-name": "Tavoitteen nimi:",
  "goal-name-placeholder": "Tavoitteen nimi",
  "goal-date": "Tavoitteen päivämäärä:",
  "goal-unit": "Tavoitteen yksikkö:",
  "goal-target-amount": "Tavoitteen kohdemäärä:",
  "goal-target-amount-placeholder": "Kohdemäärä",
  "metric-unit-examples": "Yksiköt (esim. askeleet, cm, kg)",
  "imperial-unit-examples": "Yksiköt (esim. askeleet, tuumat, lbs)",
  "select-date": "Valitse päivämäärä: {{date}}",
  "add-progress": "Lisää edistymistä",
  "add-progress-to-goal": "Lisää edistystä tavoitteeseen",
  "add-note-placeholder": "Lisää huomautus edistymiselle tänä päivänä",
  "note": "Huomautus:",
  "amount": "Määrä:",
  "amount-placeholder": "Edistymä tänään (esim. -5,10,100)",
  "goal-choice-placeholder": "Valitse tavoite tai tavoitteet lisätäksesi edistymistä",
  "add": "Lisää",
  "movement": "Liike: {{movement_name}}",
  "routine": "Rutiini: {{routine_name}}",
  "wrong-email-or-password": "Väärä sähköposti tai salasana",
  "notification-status": "Ilmoitukset ovat tällä hetkellä {{status}}",
  "enable-notifications": "Ota ilmoitukset käyttöön",
  "disable-notifications": "Poista ilmoitukset käytöstä",
  "selected-unit": "Valittu yksikkö: {{unit}}",
  "nothing-selected": "Ei mitään valittuna",
  "selected-experience": "Valittu kokemustaso: {{level}}",
  "metric": "Metriset",
  "imperial": "Imperialiset",
  "confirm": "Vahvista",
  "username-already-exists": "Käyttäjänimi on jo käytössä",
  "password-length": "Salasanan on oltava vähintään 5 merkkiä pitkä",
  "username": "Käyttäjänimi",
  "start": "Aloita",
  "no-training-plans": "Ei harjoitusohjelmia saatavilla",
  "create-routine-hint": "Paina luodaksesi rutiini luodaksesi ensimmäisen rutiinisi!",
  "select-skill-level-hint": "Valitse taitotasosi aloittaaksesi!",
  "beginner-description": "Olet uusi salilla, alle vuoden kokemus.",
  "intermediate-description": "Olet harjoitellut 1-3 vuotta ja haluat viedä kuntoilusi seuraavalle tasolle.",
  "expert-description": "Olet nostanut painoja säännöllisesti useita vuosia, tiedät mitä teet ja saatat kilpailla.",
  "next": "Seuraava",
  "tips-status": "Vinkit ovat tällä hetkellä {{status}}",
  "enabled": "Käytössä",
  "disabled": "Poissa käytöstä",
  "enable-tips": "Ota vinkit käyttöön",
  "disable-tips": "Poista vinkit käytöstä",
  "terms-of-service-title": "GymJunkie:n käyttöehdot",
  "preferences": "Asetukset",
  "terms-of-service-text-1": " 1. Ehdot\nKäyttämällä GymJunkie-sovellusta hyväksyt nämä käyttöehdot, kaikki asiaankuuluvat lait ja määräykset sekä suostut olemaan vastuussa sovellettavien paikallisten lakien noudattamisesta. Jos et hyväksy mitään näistä ehdoista, sinun on kiellettyä käyttää tai saada pääsyä tähän sovellukseen. Tämän sovelluksen materiaalit ovat suojattuja soveltuvan tekijänoikeus- ja tavaramerkkilain nojalla.\n\n",
  "terms-of-service-text-2": "2. Käyttölupa\nSaat luvan väliaikaisesti ladata yhden kopion GymJunkie-sovelluksen materiaaleista (tietoja tai ohjelmistoja) henkilökohtaiseen, ei-kaupalliseen väliaikaiseen katseluun vain. Tämä on lisenssin myöntäminen, ei siirto-oikeus, ja tämän lisenssin nojalla et saa: muuttaa tai kopioida materiaaleja; käyttää materiaaleja mihinkään kaupalliseen tarkoitukseen tai mihinkään julkiseen näyttelyyn (kaupallinen tai ei-kaupallinen); yrittää purkaa tai kääntää ohjelmistoa, joka sisältyy GymJunkie-sovellukseen; poistaa mitään tekijänoikeutta tai muita omistusoikeuden merkintöjä materiaaleista; tai siirtää materiaaleja toiselle henkilölle tai 'peilata' materiaaleja toiselle palvelimelle. Tämä lisenssi päättyy automaattisesti, jos rikot näitä rajoituksia, ja GymJunkie voi irtisanoa tämän lisenssin milloin tahansa. Kun tämä lisenssi päättyy, sinun on tuhottava kaikki ladatut materiaalit hallussasi, olivatpa ne sitten sähköisessä tai painetussa muodossa.\n\n",
  "terms-of-service-text-3": "3. Vastuuvapauslauseke\nGymJunkie-sovelluksen materiaalit toimitetaan 'sellaisenaan' perusteella. GymJunkie ei anna mitään takuita, ilmaistuja tai implisiittisiä, ja täten kieltäytyy ja kumoaa kaikki muut takuut, mukaan lukien, mutta ei niihin rajoittuen, takuut tai ehdot kaupallisesta soveltuvuudesta, tiettyyn tarkoitukseen sopivuudesta tai immateriaalioikeuksien loukkauksen puuttumisesta tai muista oikeuksien rikkomisista. Lisäksi GymJunkie ei takaa eikä tee mitään edustuksia koskien GymJunkie-sovelluksen materiaalien käytön tarkkuutta, todennäköisiä tuloksia tai luotettavuutta tai muuten liittyen tällaisiin materiaaleihin tai mihin tahansa tällä sovelluksella linkitettyihin sivustoihin.\n\n",
  "terms-of-service-text-4": "4. Rajoitukset\nMissään tapauksessa GymJunkie tai sen toimittajat eivät ole vastuussa mistään vahingoista (mukaan lukien, rajoittamatta, tietojen menetys tai voittojen menetys tai liiketoiminnan keskeytyminen), jotka johtuvat GymJunkie-sovelluksesta tai kyvyttömyydestä käyttää GymJunkie-sovelluksen materiaaleja, vaikka GymJunkie tai GymJunkie:n valtuuttama edustaja olisi ilmoitettu suullisesti tai kirjallisesti tällaisten vahinkojen mahdollisuudesta. Koska jotkut lainkäyttöalueet eivät salli implisiittisten takuiden rajoituksia tai vastuunrajoituksia epäsuorista tai satunnaisista vahingoista, nämä rajoitukset eivät välttämättä koske sinua.\n\n",
  "terms-of-service-text-5": "5. Materiaalien tarkkuus\nGymJunkie-sovelluksen materiaaleissa saattaa esiintyä teknisiä, kirjoitus- tai valokuvausvirheitä. GymJunkie ei takaa, että GymJunkie-sovelluksen materiaalit ovat tarkkoja, täydellisiä tai ajantasaisia. GymJunkie voi tehdä muutoksia GymJunkie-sovelluksen materiaaleihin milloin tahansa ilman ennakkoilmoitusta. GymJunkie ei kuitenkaan tee sitoumusta päivittää materiaaleja.\n\n",
  "terms-of-service-text-6": " 6. Linkit\nGymJunkie ei ole tarkastellut kaikkia sen sovellukseen linkitettyjä sivustoja eikä ole vastuussa mistään tällaisen linkitetyn sovelluksen sisällöstä. Minkään linkin sisällyttäminen ei merkitse GymJunkie:n hyväksyntää kyseiselle sovellukselle. Tällaisen linkitetyn sovelluksen käyttö on käyttäjän omalla vastuulla.\n\n",
  "terms-of-service-text-7": "7. Sinun tulee antaa meille ensimmäinen lapsesi\nSinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi. Sinun tulee antaa meille ensimmäinen lapsesi.\n\n",
  "how-to-create-workout": "1. Kuinka luoda harjoitus?",
  "workout-creation-hint": "Harjoituksen luomiseksi sinun on siirryttävä aloitusnäyttöön ja napsautettava 'Aloita harjoitus' -painiketta. Sen jälkeen voit valita joko luoda uuden harjoituksen tai valita harjoituksen harjoitusten luettelosta.",
  "how-to-delete-workout": "2. Kuinka poistaa harjoitus?",
  "delete-workout-hint": "Harjoituksen poistamiseksi sinun on siirryttävä aloitusnäyttöön ja napsautettava harjoitusta, jonka haluat poistaa. Voit sitten poistaa harjoituksen napsauttamalla näytön oikeassa yläkulmassa olevia kolmea pistettä ja sitten napsauttamalla 'Poista' -painiketta.",
  "how-to-create-workout-template": "3. Kuinka luoda uusia harjoituspohjia?",
  "how-to-create-routine-hint": "Uuden harjoituspohjan luomiseksi sinun on siirryttävä aloitusnäyttöön ja napautettava 'Rutiinit' alareunan navigoinnista. Voit sitten luoda uuden harjoituspohjan napsauttamalla 'Luo rutiini' -painiketta. Siitä voit lisätä uusia liikkeitä harjoituspohjaan ja tallentaa harjoituspohjan napsauttamalla 'Tallenna' -painiketta.",
  "how-to-add-movement": "4. Kuinka lisätä uusia liikkeitä?",
  "how-to-add-movement-hint": "Uusien liikkeiden lisäämiseksi sinun on siirryttävä aloitusnäyttöön ja napautettava 'Rutiinit' alareunan navigoinnista. Voit sitten luoda uuden liikkeen napsauttamalla 'Luo liike' -painiketta. Siitä voit määrittää liikkeen nimen ja lihasryhmän ja tallentaa liikkeen napsauttamalla 'Tallenna' -painiketta.",
  "measurement-unit-hint": "Valitse käyttämäsi mittayksikkö sovelluksessa.",
  "metric-example": "Esimerkiksi kilogrammat, metrit jne.",
  "imperial-example": "Esimerkiksi paunat, jalka jne.",
  "workout-example-name": "Harjoitus {{date}}",
  "workout-name": "Harjoituksen nimi",
  "notes": "Huomautukset",
  "select-movements": "Valitse Liikkeet",
  "no-exercises": "Ei lisättyjä harjoituksia",
  "finish-workout": "Lopeta Harjoitus",
  "add-set": "Lisää Sarja",
  "weight": "Paino",
  "reps": "Toistot",
  "language": "{{language}}",
  "language-settings": "Kielen Asetukset",
  "select-language": "Valitse Kieli",
  "about-description": "Tämä on kuntoilusovellus, joka auttaa sinua seuraamaan harjoituksiasi ja edistymistäsi.",
  "success": "Onnistunut!",
  "error": "Virhe!"
}
